Tekla Open API Reference for Tekla Structures 2025
FontAttributes Constructor (DrawingColors, Double, String, Boolean, Boolean)
 Creates a new font attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FontAttributes(
	DrawingColors color,
	double height,
	string fontName,
	bool italic,
	bool bold
)
Public Sub New (
	color As DrawingColors,
	height As Double,
	fontName As String,
	italic As Boolean,
	bold As Boolean
)
Parameters
color
Type: Tekla.Structures.Drawing.DrawingColors
The color of the font.
height
Type: System.Double
The height of the font.
fontName
Type: System.String
The name of the font.
italic
Type: System.Boolean
The italic specifier.
bold
Type: System.Boolean
The bold specifier.
See Also
Reference
FontAttributes Class
FontAttributes Overload
Tekla.Structures.Drawing Namespace